{"segments":[{"id":0,"start":0,"end":4.5600000000000005,"text":" Creating custom select boxes like these used to require a lot of JavaScript time,"},{"id":1,"start":4.5600000000000005,"end":8.88,"text":" third party code, and so on. But what if I told you every single one of these select boxes you're"},{"id":2,"start":8.88,"end":14.72,"text":" seeing is built directly using only HTML and CSS. That's because there's a brand new browser"},{"id":3,"start":14.72,"end":19.68,"text":" specification coming through that allows you to create entirely custom select boxes using just"},{"id":4,"start":19.68,"end":24.64,"text":" HTML and CSS and it's incredibly powerful and flexible. Honestly, it's something I never thought"},{"id":5,"start":24.64,"end":28.080000000000002,"text":" I would see in the browser. In this video, I'm going to go through what this new specification"},{"id":6,"start":28.080000000000002,"end":30.880000000000003,"text":" looks like, what you can expect and when you can start using it."},{"id":7,"start":34,"end":38,"text":" Welcome back to Web Dev Simplified. My name is Kyle and my job is to simplify the web for you"},{"id":8,"start":38,"end":41.6,"text":" so you can start building your dream project sooner. And to get started with these custom select"},{"id":9,"start":41.6,"end":45.36,"text":" elements, as you can see over here, this is the custom select element that I've created."},{"id":10,"start":45.36,"end":48.8,"text":" And this is the code that you need to do it. It's honestly not that much code."},{"id":11,"start":48.8,"end":52.56,"text":" So if we take a look at the HTML, it's rather straightforward. We create a select element just"},{"id":12,"start":52.56,"end":56.400000000000006,"text":" like we normally would. But the main difference is that now inside of our options,"},{"id":13,"start":56.4,"end":61.92,"text":" instead of just giving them a specific actual value inside here of like USA, we're now giving"},{"id":14,"start":61.92,"end":66.88,"text":" it HTML that I can actually render out. And we have this special custom HTML element called"},{"id":15,"start":66.88,"end":71.92,"text":" selected content. This is a built in HTML element built into the browser with this new select"},{"id":16,"start":71.92,"end":76.8,"text":" specification, which just gives you the HTML inside of whatever your selected option is."},{"id":17,"start":76.8,"end":80.88,"text":" So if I select United States, it's going to give me the options right here. All that HTML"},{"id":18,"start":80.88,"end":85.2,"text":" directly inside of United States. So this is all we need to do to create this custom select."},{"id":19,"start":85.2,"end":89.2,"text":" Really, it's just created a bunch of options with some HTML and put this selected content inside"},{"id":20,"start":89.2,"end":92.72,"text":" here. And I can even add stuff before this. For example, you can see that shows up beforehand,"},{"id":21,"start":92.72,"end":96.24000000000001,"text":" if I want. So it's entirely up to you, how you customize what this looks like."},{"id":22,"start":96.24000000000001,"end":100.32000000000001,"text":" Now, the more interesting part comes into the CSS. So if we look at the CSS, it's really not that"},{"id":23,"start":100.32000000000001,"end":104.56,"text":" complicated. First of all, we have a select as well as this picker select. So what this does,"},{"id":24,"start":104.56,"end":109.44,"text":" this select tag right here, we're changing the appearance to base select. All that means is that"},{"id":25,"start":109.44,"end":113.92,"text":" we're taking the normal browser based styling for select element and we're converting it to our"},{"id":26,"start":113.92,"end":118.32000000000001,"text":" own custom HTML select. So if I remove this and I just give this quick save, you can see it just"},{"id":27,"start":118.32000000000001,"end":123.04,"text":" renders a normal HTML select element. So the nice thing about this is everything gracefully"},{"id":28,"start":123.04,"end":126.88,"text":" falls back. So if a browser doesn't support this or if you're not using this appearance tag,"},{"id":29,"start":126.88,"end":130.72,"text":" everything just works like a normal select element. But as soon as we add this, what it does is it"},{"id":30,"start":130.72,"end":135.44,"text":" replaces the browser's built in styles and it replaces them with their own custom styles to kind"},{"id":31,"start":135.44,"end":139.04,"text":" of give you an idea of what that looks like. Here are two select elements. This is just a boiler"},{"id":32,"start":139.04,"end":143.36,"text":" plate basic select element. And this one over here is the base style select the new styles of what"},{"id":33,"start":143.36,"end":148,"text":" this select element looks like if you just change the appearance and nothing else. Now the second part"},{"id":34,"start":148,"end":152.08,"text":" here is this picker section. Essentially when you have your select box open, this bottom section"},{"id":35,"start":152.08,"end":155.92000000000002,"text":" that drop down that is considered the picker. So essentially I'm saying I want to change what that"},{"id":36,"start":155.92000000000002,"end":161.28000000000003,"text":" drop down looks like to also have it be based on my new select option styling. Now if we look at our"},{"id":37,"start":161.28000000000003,"end":166.16000000000003,"text":" actual important styles here, we have this selected content and option style. All that's doing is"},{"id":38,"start":166.16000000000003,"end":170.16000000000003,"text":" it styling what my options look like and what the selected content of here looks like. So I'm just"},{"id":39,"start":170.24,"end":174.24,"text":" making it display flex with a gap between them so that I have a little bit of space between my"},{"id":40,"start":174.24,"end":178.64,"text":" different elements. On each of my options, I'm giving them a little bit of extra vertical padding."},{"id":41,"start":178.64,"end":182.8,"text":" My country name, I'm changing the style on slightly. I'm adding in this flag image and giving"},{"id":42,"start":182.8,"end":187.12,"text":" it a specific width and height. And then finally here, I have this option check mark. If I remove"},{"id":43,"start":187.12,"end":191.04,"text":" this by default, all of these different selects will have a check mark on the left hand side for"},{"id":44,"start":191.04,"end":195.2,"text":" accessibility purposes. But most of the time you probably don't want that. So I'm actually"},{"id":45,"start":195.28000000000003,"end":200.16000000000003,"text":" disabling that by default just to remove that default check box from these marks. Now instead,"},{"id":46,"start":200.16000000000003,"end":203.84000000000003,"text":" I'm replacing that with this option check. So whichever one of these options is currently selected,"},{"id":47,"start":203.84000000000003,"end":207.68,"text":" it's going to have this nice light blue background. As you can see, as I change, it gets that nice"},{"id":48,"start":207.68,"end":211.44000000000003,"text":" light blue background between all of them. Now this right here is pretty much the most basic"},{"id":49,"start":211.44000000000003,"end":215.44000000000003,"text":" version of how you do this select. All you do is you create your select with all your HTML you want."},{"id":50,"start":215.44000000000003,"end":219.92000000000002,"text":" You make sure you use this selected content HTML tag. And then you want to make sure you change"},{"id":51,"start":219.92000000000002,"end":223.76000000000002,"text":" the appearance to be based select for both the drop down as well as the select element. And from"},{"id":52,"start":223.76,"end":227.2,"text":" there, you can just style things however you want. That's essentially how all these different"},{"id":53,"start":227.2,"end":230.56,"text":" selects that I were showing in the intro of this video happen. For example, this select right here"},{"id":54,"start":230.56,"end":234.16,"text":" is the exact same thing. We just have our custom drop down and we're just changing around what"},{"id":55,"start":234.16,"end":238.56,"text":" everything looks like. Same thing here for this currency selector. And then finally for this selector"},{"id":56,"start":238.56,"end":242.48,"text":" right here again, we're just changing them under everything looks like. Now this is a specification"},{"id":57,"start":242.48,"end":246.23999999999998,"text":" that's very well detailed inside of this blog right here. I'll scroll to the top here. This is the"},{"id":58,"start":246.23999999999998,"end":250.56,"text":" request for Dell Veloper feedback on the customizable select on the Chrome for dev blog. I'll link"},{"id":59,"start":250.72,"end":255.2,"text":" this into description. One thing to note about this blog in particular is it is slightly out of date."},{"id":60,"start":255.2,"end":258.56,"text":" For example, I scroll down to this section, which is the most important section telling you what"},{"id":61,"start":258.56,"end":263.84000000000003,"text":" each thing does. You'll notice here it's called selected option and option before. While as we"},{"id":62,"start":263.84000000000003,"end":267.92,"text":" looked at our code, you can see this is called selected content and this is option checkmark. So"},{"id":63,"start":267.92,"end":271.52,"text":" there's a few things that are slightly out of date. What I would recommend doing at the very top"},{"id":64,"start":271.52,"end":275.6,"text":" of this blog article, they have a link here that brings you to the code pen collection. Click on"},{"id":65,"start":275.6,"end":279.36,"text":" that link and that's going to bring you to an updated version of all these different code pens that"},{"id":66,"start":279.36,"end":282.88,"text":" have everything that I've showed you in this video. So that would be what I recommend. Also,"},{"id":67,"start":282.88,"end":286.72,"text":" if you want to use this feature currently, you need to do it inside of the canary version of Chrome"},{"id":68,"start":286.72,"end":291.84000000000003,"text":" and enable the experimental web platform features. Now this feature is currently in stage two,"},{"id":69,"start":291.84000000000003,"end":296.08000000000004,"text":" which means that most likely there's not going to be a ton of changes to the API. But obviously,"},{"id":70,"start":296.08000000000004,"end":299.52000000000004,"text":" as you've seen, there have been some changes to the API from when I created this video to when"},{"id":71,"start":299.52000000000004,"end":302.96000000000004,"text":" that blog article is written. So there are some changes that could happen, but for the most part,"},{"id":72,"start":302.96000000000004,"end":306.24,"text":" it's probably going to be pretty similar to what I've shown you here. And again, the really"},{"id":73,"start":306.32,"end":310.72,"text":" nice thing about this is it has a graceful fallback. For example, if I open this inside of Google"},{"id":74,"start":310.72,"end":314.08,"text":" Chrome normally, you can see this is a normal Google Chrome instance. It doesn't support any of"},{"id":75,"start":314.08,"end":318.48,"text":" this fancy stuff. You can see it still works just like a normal select box. So the really nice"},{"id":76,"start":318.48,"end":322.16,"text":" thing is you can start using this immediately. And even if a browser doesn't support it,"},{"id":77,"start":322.16,"end":325.44,"text":" it's still going to show you the default select box. And then as soon as you get a browser that"},{"id":78,"start":325.44,"end":329.44,"text":" does support it, you're going to get all of these really extra fancy features. Now, if you enjoyed"},{"id":79,"start":329.44,"end":334,"text":" these more bleeding edge style videos where I cover the latest and greatest inside of CSS HTML"},{"id":80,"start":334,"end":337.36,"text":" and JavaScript, you're going to love the videos right over here. One of them talks about the"},{"id":81,"start":337.36,"end":342.16,"text":" anchor position and how it's absolutely amazing inside of CSS. It's my favorite thing coming to CSS."},{"id":82,"start":342.16,"end":346.4,"text":" I highly recommend checking that out. With that said, thank you very much for watching and have a good day."}]}